-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2025-05-18 13:06:58
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `tree_data`
--

-- --------------------------------------------------------

--
-- 資料表結構 `emission_factors`
--

CREATE TABLE `emission_factors` (
  `id` int(11) NOT NULL,
  `activity_type` varchar(50) NOT NULL,
  `unit` varchar(20) NOT NULL,
  `factor_value` decimal(10,4) NOT NULL,
  `source` varchar(255) NOT NULL,
  `last_review` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `emission_factors`
--

INSERT INTO `emission_factors` (`id`, `activity_type`, `unit`, `factor_value`, `source`, `last_review`) VALUES
(1, '電力', 'kWh', 0.6060, '環境部 電力碳足跡(2021)', '2023-12-01'),
(2, '電力間接', 'kWh', 0.0973, '環境部 電力間接碳足跡(2021)', '2023-12-01'),
(3, '台灣自來水', 'm3', 0.2330, '環境部 臺灣自來水(2020)', '2022-12-01'),
(4, '臺北自來水', 'm3', 0.0948, '環境部 臺北自來水(2020)', '2022-12-01'),
(5, '燃料油(蒸餘油/重油)固定源', 'L', 3.8800, '環境部 燃料油使用(蒸餘油/重油使用，2021)', '2023-12-01'),
(6, '柴油固定源', 'L', 3.2900, '環境部 柴油(於固定源使用，2021)', '2023-12-01'),
(7, '汽油固定源', 'L', 2.8800, '環境部 車用汽油(於固定源使用，2021)', '2023-12-01'),
(8, '天然氣固定源', 'm3', 2.6300, '環境部 天然氣(於固定源使用，2021)', '2023-12-01'),
(9, '液化石油氣固定源', 'L', 2.2100, '環境部 液化石油氣(於固定源使用，2021)', '2023-12-01'),
(10, '煤油固定源', 'L', 2.9100, '環境部 煤油使用(2021)', '2023-12-01'),
(11, '柴油公路運輸', 'L', 3.3200, '環境部 柴油(於公路運輸移動源使用，2021)', '2023-12-01'),
(12, '柴油鐵路非道路運輸', 'L', 3.5600, '環境部 柴油（於鐵路運輸與非道路運輸移動源使用，2021）', '2023-12-01'),
(13, '柴油水路運輸', 'L', 3.3000, '環境部 柴油（於水路運輸移動源使用，2021）', '2023-12-01'),
(14, '柴油捕撈移動源', 'L', 3.2900, '環境部 柴油（於捕撈移動源使用，2021）', '2023-12-01'),
(15, '自用大客車(柴油)', 'pkm', 0.0606, '交通部運輸研究所 (2014)', '2014-12-01'),
(16, '營業大客車(市區公車及公路客運-柴油)', 'pkm', 0.0944, '交通部運輸研究所 (2014)', '2014-12-01'),
(17, '營業遊覽車(柴油)', 'pkm', 0.0441, '交通部運輸研究所 (2014)', '2014-12-01'),
(18, '自用大貨車(柴油)', 'tkm', 0.2235, '交通部運輸研究所 (2014)', '2014-12-01'),
(19, '自用小貨車(柴油)', 'tkm', 0.6930, '交通部運輸研究所 (2014)', '2014-12-01'),
(20, '營業小貨車(柴油)', 'tkm', 0.6470, '交通部運輸研究所 (2014)', '2014-12-01'),
(21, '營業大貨車(柴油)', 'tkm', 0.2350, '交通部運輸研究所 (2014)', '2014-12-01'),
(22, '汽油移動源', 'L', 2.9200, '環境部 車用汽油(於移動源使用，2021)', '2023-12-01'),
(23, '自用小客車(汽油)', 'pkm', 0.1150, '交通部運輸研究所 (2014)', '2014-12-01'),
(24, '營業小客車(汽油)', 'pkm', 0.1330, '交通部運輸研究所 (2014)', '2014-12-01'),
(25, '機器腳踏車(汽油)', 'pkm', 0.0951, '交通部運輸研究所 (2014)', '2014-12-01'),
(26, '自用小貨車(汽油)', 'tkm', 0.7393, '交通部運輸研究所 (2014)', '2014-12-01'),
(27, '營業小貨車(汽油)', 'tkm', 0.6259, '交通部運輸研究所 (2014)', '2014-12-01'),
(28, '高速鐵路運輸服務', 'pkm', 0.0340, '環境部、台灣高速鐵路股份有限公司 (2018)', '2018-12-01'),
(29, '臺灣鐵路運輸服務(柴聯車)', 'pkm', 0.0700, '交通部鐵路改建工程局 (2015)', '2015-12-01'),
(30, '臺灣鐵路運輸服務(電聯車)', 'pkm', 0.0540, '交通部鐵路改建工程局 (2015)', '2015-12-01'),
(31, '聚丙烯(PP)', 'kg', 1.9500, '環境部 (2023)', '2023-12-01'),
(32, '低密度聚乙烯(LDPE)', 'kg', 1.9000, '經濟部工業局 (2013)', '2013-12-01'),
(33, '高密度聚乙烯(HDPE)', 'kg', 2.2100, '環境部 (2023)', '2023-12-01'),
(34, '聚氯乙烯(PVC)', 'kg', 3.0200, '環境部 (2021)', '2021-12-01'),
(35, '聚對苯二甲酸乙二酯(PET)', 'kg', 2.7400, '環境部 (2022)', '2022-12-01'),
(36, '生鐵', 'kg', 1.8130, '中國鋼鐵股份有限公司 (2013)', '2013-12-01'),
(37, '鋼板', 'kg', 2.4150, '中國鋼鐵股份有限公司 (2013)', '2013-12-01'),
(38, '鋁錠', 'kg', 9.8493, '經濟部工業局 (2013)', '2013-12-01'),
(39, '再生鋁錠', 'kg', 0.7000, '環境部 (2015)', '2015-12-01'),
(40, '牛皮紙', 'kg', 1.2200, '環境部 (2023)', '2023-12-01'),
(41, '瓦楞芯紙', 'kg', 0.9880, '環境部 (2023)', '2023-12-01'),
(42, '原生木漿影印紙', 'kg', 3.6000, '中華紙漿股份有限公司花蓮廠 (2018)', '2018-12-01'),
(43, '再生影印紙', 'kg', 3.0830, '環境部 (2014)', '2014-12-01'),
(44, '水泥熟料', 'kg', 0.9480, '公路總局蘇花公路改善工程處 (2017)', '2017-12-01'),
(45, '玻璃容器', 'kg', 1.1500, '環境部 (2022)', '2022-12-01'),
(46, '航空貨物運輸服務', 'tkm', 1.1600, '環境部 (2017)', '2017-12-01'),
(47, '國內海運貨物運輸服務(柴油動力)', 'tkm', 0.0334, '環境部 (2016)', '2016-12-01'),
(48, '國際海運貨物運輸服務(燃料油動力)', 'tkm', 0.0198, '環境部 (2016)', '2016-12-01'),
(49, '航空旅客運輸服務(松山-金門)', 'pkm', 0.2810, '環境部、交通部民用航空局、松山機場、金門機場、華信航空、台灣航勤 (2018)', '2018-12-01'),
(50, '不鏽鋼鋼胚', 'kg', 1.1300, '環境部 (2013)', '2013-12-01'),
(51, '不鏽鋼冷軋鋼捲', 'kg', 1.4600, '環境部 (2013)', '2013-12-01'),
(52, '金', 'kg', 11.1046, '經濟部工業局 (2013)', '2013-12-01'),
(53, '鉑', 'kg', 7.1167, '經濟部工業局 (2013)', '2013-12-01'),
(54, '純銅線', 'kg', 4.3881, '經濟部工業局 (2013)', '2013-12-01'),
(55, '鋅錠', 'kg', 9.1800, '經濟部工業局 (2014)', '2014-12-01'),
(56, '再生鋅錠', 'kg', 0.0400, '環境部 (2017)', '2017-12-01'),
(57, '乙二醇', 'kg', 1.8100, '環境部 (2022)', '2022-12-01'),
(58, '異丙醇', 'kg', 1.4990, '經濟部工業局 (2013)', '2013-12-01'),
(59, '甲醛，37％', 'kg', 0.7000, '經濟部工業局 (2013)', '2013-12-01'),
(60, '環氧樹脂', 'kg', 3.0200, '經濟部工業局 (2013)', '2013-12-01'),
(61, '氨', 'kg', 1.8700, '經濟部工業局 (2014)', '2014-12-01'),
(62, '鹽酸，37％', 'kg', 1.6900, '經濟部工業局 (2014)', '2014-12-01'),
(63, '硫酸，98％', 'kg', 0.1470, '經濟部工業局 (2014)', '2014-12-01'),
(64, '氫氧化鈉，45％', 'kg', 0.6750, '環境部 (2022)', '2022-12-01'),
(65, '甲醇', 'kg', 2.3400, '經濟部工業局 (2014)', '2014-12-01'),
(66, '水泥(不分型號)', 'kg', 0.9070, '公路總局蘇花公路改善工程處 (2017)', '2017-12-01'),
(67, '預拌混凝土(210kgf/cm2)', 'm3', 238.0000, '公路總局西部濱海公路南區臨時工程處 (2019)', '2019-12-01'),
(68, '預拌混凝土(280kgf/cm2)', 'm3', 338.0000, '公路總局西部濱海公路南區臨時工程處 (2019)', '2019-12-01'),
(69, '鋼筋', 'kg', 0.6600, '環境部 (2015)', '2015-12-01'),
(70, '平板玻璃', 'kg', 1.1200, '環境部 (2016)', '2016-12-01'),
(71, '瓦楞紙板(AB楞)', 'kg', 1.3000, '環境部 (2023)', '2023-12-01'),
(72, '食品包裝紙容器', 'kg', 8.2400, '環境部 (2016)', '2016-12-01'),
(73, '廢棄物焚化清理服務(南部科學工業園區-台南園區)', 't', 737.1400, '南部科學工業園區管局台南園區資源再生中心 (2014)', '2014-12-01'),
(74, '廢棄物掩埋清理服務(南部科學工業園區-台南園區)', 't', 7.0700, '南部科學工業園區管局台南園區資源再生中心 (2014)', '2014-12-01'),
(75, '有害事業廢棄物固化處理服務', 't', 130.0000, '環境部 (2020)', '2020-12-01'),
(76, '食用大豆油', 'kg', 1.2300, '衛生福利部食品藥物管理署 (2014)', '2014-12-01'),
(77, '鮮乳', 'kg', 2.4800, '金門縣畜產試驗所 (2017)', '2017-12-01'),
(78, '瓶裝水（600ml，PET包裝）', '瓶', 0.1210, '泰山企業股份有限公司 (2020)', '2020-12-01'),
(79, 'OPP膠帶(0.043mm*48mm*80M)', '卷', 0.9700, '地球綜合工業股份有限公司 (2020)', '2020-12-01');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `emission_factors`
--
ALTER TABLE `emission_factors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_activity_unit` (`activity_type`,`unit`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `emission_factors`
--
ALTER TABLE `emission_factors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
